KiTaeHan/RA6E1_Examples/analog/hal_entry.c
#include "hal_data.h"
#include "RTT/SEGGER_RTT.h"

FSP_CPP_HEADER
void R_BSP_WarmStart(bsp_warm_start_event_t event);
FSP_CPP_FOOTER

/*******************************************************************************************************************//**
 * main() is generated by the RA Configuration editor and is used to generate threads if an RTOS is used.  This function
 * is called by main() when no RTOS is used.
 **********************************************************************************************************************/
void hal_entry(void)
{
    /* TODO: add your own code here */
    uint16_t data;
    uint16_t dac_data = 0;

    SEGGER_RTT_printf(0,"Start Application\r\n");

    R_DAC_Open(&g_dac0_ctrl, &g_dac0_cfg);

    R_ADC_Open(&g_adc0_ctrl, &g_adc0_cfg);
    R_ADC_ScanCfg(&g_adc0_ctrl, &g_adc0_channel_cfg);
    R_ADC_ScanStart(&g_adc0_ctrl);

    while(1)
    {
        R_ADC_Read(&g_adc0_ctrl, ADC_CHANNEL_0, &data);
        SEGGER_RTT_printf(0, "CDS: %d\r\n", data);
        R_ADC_Read(&g_adc0_ctrl, ADC_CHANNEL_1, &data);
        SEGGER_RTT_printf(0, "Potentiometer: %d\r\n", data);
        if(data != dac_data)
        {
            dac_data = data;
            R_DAC_Stop(&g_dac0_ctrl);
            R_DAC_Write(&g_dac0_ctrl, dac_data);
            R_DAC_Start(&g_dac0_ctrl);
        }

        R_BSP_SoftwareDelay (100, BSP_DELAY_UNITS_MILLISECONDS);
    }

#if BSP_TZ_SECURE_BUILD
    /* Enter non-secure code */
    R_BSP_NonSecureEnter();
#endif
}

/*******************************************************************************************************************//**
 * This function is called at various points during the startup process.  This implementation uses the event that is
 * called right before main() to set up the pins.
 *
 * @param[in]  event    Where at in the start up process the code is currently at
 **********************************************************************************************************************/
void R_BSP_WarmStart(bsp_warm_start_event_t event)
{
    if (BSP_WARM_START_RESET == event)
    {
#if BSP_FEATURE_FLASH_LP_VERSION != 0

        /* Enable reading from data flash. */
        R_FACI_LP->DFLCTL = 1U;

        /* Would normally have to wait tDSTOP(6us) for data flash recovery. Placing the enable here, before clock and
         * C runtime initialization, should negate the need for a delay since the initialization will typically take more than 6us. */
#endif
    }

    if (BSP_WARM_START_POST_C == event)
    {
        /* C runtime environment and system clocks are setup. */

        /* Configure pins. */
        R_IOPORT_Open (&g_ioport_ctrl, g_ioport.p_cfg);
    }
}

#if BSP_TZ_SECURE_BUILD

BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ();

/* Trustzone Secure Projects require at least one nonsecure callable function in order to build (Remove this if it is not required to build). */
BSP_CMSE_NONSECURE_ENTRY void template_nonsecure_callable ()
{

}
#endif
